app/controllers/schoolclasses_controller.rb

    def index
        @schoolclasses = Schoolclass.all
---
SELECT "schoolclasses".* FROM "schoolclasses"

    def show
        @schoolclass = Schoolclass.find(params[:id])
---
SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @schoolclass = Schoolclass.new(schoolclass_params)
        @schoolclass.save
---
INSERT INTO "schoolclasses" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Bio"], ["room_number", 35], ["created_at", "2020-07-17 22:37:49.768215"], ["updated_at", "2020-07-17 22:37:49.768215"]]

    def edit
        @schoolclass = Schoolclass.find(params[:id])
---
SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @schoolclass = Schoolclass.find(params[:id])
        @schoolclass.update(schoolclass_params)
---
SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schoolclasses" SET "room_number" = ?, "updated_at" = ? WHERE "schoolclasses"."id" = ?  [["room_number", 50], ["updated_at", "2020-07-17 22:39:33.782310"], ["id", 1]]