app/controllers/students_controller.rb

    def create
        @student = Student.new(students_params)
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "testy"], ["last_name", "testerson"], ["created_at", "2020-07-17 22:22:17.257771"], ["updated_at", "2020-07-17 22:22:17.257771"]]

    def update
        @student = Student.find(params[:id])
        @student.update(students_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "skippy"], ["updated_at", "2020-07-17 22:24:38.147878"], ["id", 3]]